Every-Flavor-Robotics/motorgo-experimental-boards/motorgo_experimental_0.1/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################

motorgo_plink.name=MotorGo Plink (Beta)
motorgo_plink.vid.0=0x303a
motorgo_plink.pid.0=0x1001

motorgo_plink.bootloader.tool=esptool_py
motorgo_plink.bootloader.tool.default=esptool_py

motorgo_plink.upload.tool=esptool_py
motorgo_plink.upload.tool.default=esptool_py
motorgo_plink.upload.tool.network=esp_ota

motorgo_plink.upload.maximum_size=1310720
motorgo_plink.upload.maximum_data_size=327680
motorgo_plink.upload.flags=
motorgo_plink.upload.extra_flags=
motorgo_plink.upload.use_1200bps_touch=false
motorgo_plink.upload.wait_for_upload_port=false

motorgo_plink.serial.disableDTR=false
motorgo_plink.serial.disableRTS=false

motorgo_plink.build.tarch=xtensa
motorgo_plink.build.bootloader_addr=0x0
motorgo_plink.build.target=esp32s3
motorgo_plink.build.mcu=esp32s3
motorgo_plink.build.core=esp32
motorgo_plink.build.variant=motorgo_plink
motorgo_plink.build.board=MOTORGO_PLINK

motorgo_plink.build.usb_mode=1
motorgo_plink.build.cdc_on_boot=1
motorgo_plink.build.msc_on_boot=0
motorgo_plink.build.dfu_on_boot=0
motorgo_plink.build.f_cpu=240000000L
motorgo_plink.build.flash_size=4MB
motorgo_plink.build.flash_freq=80m
motorgo_plink.build.flash_mode=dio
motorgo_plink.build.boot=qio
motorgo_plink.build.boot_freq=80m
motorgo_plink.build.partitions=default
motorgo_plink.build.defines=
motorgo_plink.build.loop_core=
motorgo_plink.build.event_core=
motorgo_plink.build.psram_type=qspi
motorgo_plink.build.memory_type={build.boot}_{build.psram_type}


## IDE 2.0 Seems to not update the value
motorgo_plink.menu.JTAGAdapter.default=Disabled
motorgo_plink.menu.JTAGAdapter.default.build.copy_jtag_files=0
motorgo_plink.menu.JTAGAdapter.builtin=Integrated USB JTAG
motorgo_plink.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
motorgo_plink.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
motorgo_plink.menu.JTAGAdapter.external=FTDI Adapter
motorgo_plink.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
motorgo_plink.menu.JTAGAdapter.external.build.copy_jtag_files=1
motorgo_plink.menu.JTAGAdapter.bridge=ESP USB Bridge
motorgo_plink.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
motorgo_plink.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

motorgo_plink.menu.PSRAM.disabled=Disabled
motorgo_plink.menu.PSRAM.disabled.build.defines=
motorgo_plink.menu.PSRAM.disabled.build.psram_type=qspi
motorgo_plink.menu.PSRAM.enabled=QSPI PSRAM
motorgo_plink.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
motorgo_plink.menu.PSRAM.enabled.build.psram_type=qspi
motorgo_plink.menu.PSRAM.opi=OPI PSRAM
motorgo_plink.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
motorgo_plink.menu.PSRAM.opi.build.psram_type=opi

motorgo_plink.menu.FlashMode.qio=QIO 80MHz
motorgo_plink.menu.FlashMode.qio.build.flash_mode=dio
motorgo_plink.menu.FlashMode.qio.build.boot=qio
motorgo_plink.menu.FlashMode.qio.build.boot_freq=80m
motorgo_plink.menu.FlashMode.qio.build.flash_freq=80m
motorgo_plink.menu.FlashMode.qio120=QIO 120MHz
motorgo_plink.menu.FlashMode.qio120.build.flash_mode=dio
motorgo_plink.menu.FlashMode.qio120.build.boot=qio
motorgo_plink.menu.FlashMode.qio120.build.boot_freq=120m
motorgo_plink.menu.FlashMode.qio120.build.flash_freq=80m
motorgo_plink.menu.FlashMode.dio=DIO 80MHz
motorgo_plink.menu.FlashMode.dio.build.flash_mode=dio
motorgo_plink.menu.FlashMode.dio.build.boot=dio
motorgo_plink.menu.FlashMode.dio.build.boot_freq=80m
motorgo_plink.menu.FlashMode.dio.build.flash_freq=80m
motorgo_plink.menu.FlashMode.opi=OPI 80MHz
motorgo_plink.menu.FlashMode.opi.build.flash_mode=dout
motorgo_plink.menu.FlashMode.opi.build.boot=opi
motorgo_plink.menu.FlashMode.opi.build.boot_freq=80m
motorgo_plink.menu.FlashMode.opi.build.flash_freq=80m

motorgo_plink.menu.FlashSize.4M=4MB (32Mb)
motorgo_plink.menu.FlashSize.4M.build.flash_size=4MB
motorgo_plink.menu.FlashSize.8M=8MB (64Mb)
motorgo_plink.menu.FlashSize.8M.build.flash_size=8MB
motorgo_plink.menu.FlashSize.8M.build.partitions=default_8MB
motorgo_plink.menu.FlashSize.16M=16MB (128Mb)
motorgo_plink.menu.FlashSize.16M.build.flash_size=16MB
motorgo_plink.menu.FlashSize.32M=32MB (256Mb)
motorgo_plink.menu.FlashSize.32M.build.flash_size=32MB

motorgo_plink.menu.LoopCore.1=Core 1
motorgo_plink.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
motorgo_plink.menu.LoopCore.0=Core 0
motorgo_plink.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

motorgo_plink.menu.EventsCore.1=Core 1
motorgo_plink.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
motorgo_plink.menu.EventsCore.0=Core 0
motorgo_plink.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

