Every-Flavor-Robotics/motorgo-experimental-boards/motorgo_experimental_0.1/boards.txt
motorgo_plink.menu.USBMode.hwcdc=Hardware CDC and JTAG
motorgo_plink.menu.USBMode.hwcdc.build.usb_mode=1
motorgo_plink.menu.USBMode.default=USB-OTG (TinyUSB)
motorgo_plink.menu.USBMode.default.build.usb_mode=0

motorgo_plink.menu.CDCOnBoot.default=Enabled
motorgo_plink.menu.CDCOnBoot.default.build.cdc_on_boot=1
motorgo_plink.menu.CDCOnBoot.cdc=Disabled
motorgo_plink.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

motorgo_plink.menu.MSCOnBoot.default=Disabled
motorgo_plink.menu.MSCOnBoot.default.build.msc_on_boot=0
motorgo_plink.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
motorgo_plink.menu.MSCOnBoot.msc.build.msc_on_boot=1

motorgo_plink.menu.DFUOnBoot.default=Disabled
motorgo_plink.menu.DFUOnBoot.default.build.dfu_on_boot=0
motorgo_plink.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
motorgo_plink.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

motorgo_plink.menu.UploadMode.default=UART0 / Hardware CDC
motorgo_plink.menu.UploadMode.default.upload.use_1200bps_touch=false
motorgo_plink.menu.UploadMode.default.upload.wait_for_upload_port=false
motorgo_plink.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
motorgo_plink.menu.UploadMode.cdc.upload.use_1200bps_touch=true
motorgo_plink.menu.UploadMode.cdc.upload.wait_for_upload_port=true

motorgo_plink.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
motorgo_plink.menu.PartitionScheme.default.build.partitions=default
motorgo_plink.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
motorgo_plink.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
motorgo_plink.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
motorgo_plink.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
motorgo_plink.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
motorgo_plink.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
motorgo_plink.menu.PartitionScheme.minimal.build.partitions=minimal
motorgo_plink.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
motorgo_plink.menu.PartitionScheme.no_ota.build.partitions=no_ota
motorgo_plink.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
motorgo_plink.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
motorgo_plink.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
motorgo_plink.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
motorgo_plink.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
motorgo_plink.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
motorgo_plink.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
motorgo_plink.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
motorgo_plink.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
motorgo_plink.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
motorgo_plink.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
motorgo_plink.menu.PartitionScheme.huge_app.build.partitions=huge_app
motorgo_plink.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
motorgo_plink.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
motorgo_plink.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
motorgo_plink.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
motorgo_plink.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
motorgo_plink.menu.PartitionScheme.fatflash.build.partitions=ffat
motorgo_plink.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
motorgo_plink.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
motorgo_plink.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
motorgo_plink.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
motorgo_plink.menu.PartitionScheme.rainmaker=RainMaker
motorgo_plink.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
motorgo_plink.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

motorgo_plink.menu.CPUFreq.240=240MHz (WiFi)
motorgo_plink.menu.CPUFreq.240.build.f_cpu=240000000L
motorgo_plink.menu.CPUFreq.160=160MHz (WiFi)
motorgo_plink.menu.CPUFreq.160.build.f_cpu=160000000L
motorgo_plink.menu.CPUFreq.80=80MHz (WiFi)
motorgo_plink.menu.CPUFreq.80.build.f_cpu=80000000L
motorgo_plink.menu.CPUFreq.40=40MHz
motorgo_plink.menu.CPUFreq.40.build.f_cpu=40000000L
motorgo_plink.menu.CPUFreq.20=20MHz
motorgo_plink.menu.CPUFreq.20.build.f_cpu=20000000L
motorgo_plink.menu.CPUFreq.10=10MHz
motorgo_plink.menu.CPUFreq.10.build.f_cpu=10000000L

motorgo_plink.menu.UploadSpeed.921600=921600
motorgo_plink.menu.UploadSpeed.921600.upload.speed=921600
motorgo_plink.menu.UploadSpeed.115200=115200
motorgo_plink.menu.UploadSpeed.115200.upload.speed=115200
motorgo_plink.menu.UploadSpeed.256000.windows=256000
motorgo_plink.menu.UploadSpeed.256000.upload.speed=256000
motorgo_plink.menu.UploadSpeed.230400.windows.upload.speed=256000
motorgo_plink.menu.UploadSpeed.230400=230400
motorgo_plink.menu.UploadSpeed.230400.upload.speed=230400
motorgo_plink.menu.UploadSpeed.460800.linux=460800
motorgo_plink.menu.UploadSpeed.460800.macosx=460800
motorgo_plink.menu.UploadSpeed.460800.upload.speed=460800
motorgo_plink.menu.UploadSpeed.512000.windows=512000
motorgo_plink.menu.UploadSpeed.512000.upload.speed=512000

motorgo_plink.menu.DebugLevel.none=None
motorgo_plink.menu.DebugLevel.none.build.code_debug=0
motorgo_plink.menu.DebugLevel.error=Error
motorgo_plink.menu.DebugLevel.error.build.code_debug=1
motorgo_plink.menu.DebugLevel.warn=Warn
motorgo_plink.menu.DebugLevel.warn.build.code_debug=2
motorgo_plink.menu.DebugLevel.info=Info
motorgo_plink.menu.DebugLevel.info.build.code_debug=3
motorgo_plink.menu.DebugLevel.debug=Debug
motorgo_plink.menu.DebugLevel.debug.build.code_debug=4
motorgo_plink.menu.DebugLevel.verbose=Verbose
motorgo_plink.menu.DebugLevel.verbose.build.code_debug=5

motorgo_plink.menu.EraseFlash.none=Disabled
motorgo_plink.menu.EraseFlash.none.upload.erase_cmd=
motorgo_plink.menu.EraseFlash.all=Enabled
motorgo_plink.menu.EraseFlash.all.upload.erase_cmd=-e

