Every-Flavor-Robotics/motorgo-experimental-boards/motorgo_experimental_0.1/boards.txt
motorgo_axis.menu.UploadSpeed.921600=921600
motorgo_axis.menu.UploadSpeed.921600.upload.speed=921600
motorgo_axis.menu.UploadSpeed.115200=115200
motorgo_axis.menu.UploadSpeed.115200.upload.speed=115200
motorgo_axis.menu.UploadSpeed.256000.windows=256000
motorgo_axis.menu.UploadSpeed.256000.upload.speed=256000
motorgo_axis.menu.UploadSpeed.230400.windows.upload.speed=256000
motorgo_axis.menu.UploadSpeed.230400=230400
motorgo_axis.menu.UploadSpeed.230400.upload.speed=230400
motorgo_axis.menu.UploadSpeed.460800.linux=460800
motorgo_axis.menu.UploadSpeed.460800.macosx=460800
motorgo_axis.menu.UploadSpeed.460800.upload.speed=460800
motorgo_axis.menu.UploadSpeed.512000.windows=512000
motorgo_axis.menu.UploadSpeed.512000.upload.speed=512000

motorgo_axis.menu.DebugLevel.none=None
motorgo_axis.menu.DebugLevel.none.build.code_debug=0
motorgo_axis.menu.DebugLevel.error=Error
motorgo_axis.menu.DebugLevel.error.build.code_debug=1
motorgo_axis.menu.DebugLevel.warn=Warn
motorgo_axis.menu.DebugLevel.warn.build.code_debug=2
motorgo_axis.menu.DebugLevel.info=Info
motorgo_axis.menu.DebugLevel.info.build.code_debug=3
motorgo_axis.menu.DebugLevel.debug=Debug
motorgo_axis.menu.DebugLevel.debug.build.code_debug=4
motorgo_axis.menu.DebugLevel.verbose=Verbose
motorgo_axis.menu.DebugLevel.verbose.build.code_debug=5

motorgo_axis.menu.EraseFlash.none=Disabled
motorgo_axis.menu.EraseFlash.none.upload.erase_cmd=
motorgo_axis.menu.EraseFlash.all=Enabled
motorgo_axis.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################